Autodesk.Revit.DB.FamilySizeTableManager.GetFamilySizeTableManager(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets a FamilySizeTableManager from a Family
document:
Family owned document or a project document
familyId:
ElementId of the  Family.
Returns:
The FamilySizeTableManager of the Family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FamilySizeTableManager.CreateFamilySizeTableManager(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Adds FamilySizeTableManager to a Family.
A FamilySizeTableManager and FamilySizeTables are only needed when
importing, exporting, or removing size data previously stored in CSV files.
document:
Family owned document or project document.
familyId:
ElementId of the Family.
Returns:
True if successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FamilySizeTableManager.RemoveSizeTable(System.String)
Removes the FamilySizeTable of a given name.
tableName:
The FamilySizeTable name.
Returns:
True if successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FamilySizeTableManager.ExportSizeTable(System.String,System.String)
Exports the size table to  aCSV file.
tableName:
The bool name to export.
filePath:
The CSV file to export to.
Returns:
True if successful, false otherwise..
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FamilySizeTableManager.ImportSizeTable(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.FamilySizeTableErrorInfo)
Imports a FamilySizeTable from a CSV file.
document:
Family owned document or project document.
filePath:
The CSV file path.
errorInfo:
An error object to be written to if errors occur.
Returns:
True if successful, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FamilySizeTableManager.HasSizeTable(System.String)
Checks if a FamilySizeTable of a given name exists.
tableName:
The name of the FamilySizeTable.
Returns:
True if the FamilySizeTable exists, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FamilySizeTableManager.GetSizeTable(System.String)
Get a FamilySizeTable by name.
tableName:
The FamilySizeTable name.
Returns:
The FamilySizeTable of a given name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.FamilySizeTableManager.GetAllSizeTableNames
Get the FamilySizeTable names in a family.
Returns:
Array of size table names.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableManager.NumberOfSizeTables
The number of FamilySizeTables in a family.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableManager
Manages importing, exporting, and querying size data through the FamilySizeTable class.
Since:
2014